In [1]:
from pandas import Series, DataFrame
import numpy as np

In [2]:
s1 = Series([1,2,3,4], index=['a','b','c','d'])
print(s1)

a    1
b    2
c    3
d    4
dtype: int64

In [3]:
s2 = Series([5,6,7,8], index=['a','b','c','d'])
print(s2)

a    5
b    6
c    7
d    8
dtype: int64

In [4]:
print(s1+s2) # 같은 인덱스명을 가지고 있기 때문에 연산가능

a     6
b     8
c    10
d    12
dtype: int64

In [6]:
df1 = DataFrame(np.arange(9.).reshape(3,3)
                , columns=list('abc')
                , index=['서울','도쿄','뉴욕'])
df1

      a    b    c
서울  0.0  1.0  2.0
도쿄  3.0  4.0  5.0
뉴욕  6.0  7.0  8.0

In [7]:
df2 = DataFrame(np.arange(12.).reshape(4,3)
                , columns=list('abc')
                , index=['서울','도쿄','뉴욕','북경'])
df2

      a     b     c
서울  0.0   1.0   2.0
도쿄  3.0   4.0   5.0
뉴욕  6.0   7.0   8.0
북경  9.0  10.0  11.0

In [8]:
print(df1+df2)

       a     b     c
뉴욕  12.0  14.0  16.0
도쿄   6.0   8.0  10.0
북경   NaN   NaN   NaN
서울   0.0   2.0   4.0

In [10]:
print(df1.add(df2))
print(df1.add(df2, fill_value=0)) # NaN은 0으로 채워 넣었다.

       a     b     c
뉴욕  12.0  14.0  16.0
도쿄   6.0   8.0  10.0
북경   NaN   NaN   NaN
서울   0.0   2.0   4.0
       a     b     c
뉴욕  12.0  14.0  16.0
도쿄   6.0   8.0  10.0
북경   9.0  10.0  11.0
서울   0.0   2.0   4.0

In [17]:
print("기술 통계량 제공 메서드와 NaN 처리")
df=DataFrame([[1.4, np.nan], [7,-4.5],[np.nan, np.nan],[0.5,-1]],columns=['one','two'],index=['a','b','c','d'])
df

기술 통계량 제공 메서드와 NaN 처리

   one  two
a  1.4  NaN
b  7.0 -4.5
c  NaN  NaN
d  0.5 -1.0

In [18]:
print(df.dropna(how='all')) # 전체의 행의 값이 NaN인 것을 drop, a 열은 제거가 안됨

   one  two
a  1.4  NaN
b  7.0 -4.5
d  0.5 -1.0

In [19]:
#na를 0으로 처리
print(df.fillna(0))

   one  two
a  1.4  0.0
b  7.0 -4.5
c  0.0  0.0
d  0.5 -1.0

In [20]:
print(df.sum(axis=0)) # x축으로 합계

one    8.9
two   -5.5
dtype: float64

In [22]:
print(df.sum(axis=1)) # y축으로 합계

a    1.4
b    2.5
c    0.0
d   -0.5
dtype: float64

In [24]:
# 열 기준으로 평균을 구하면?
print(df.mean(axis=0))

a    1.40
b    1.25
c     NaN
d   -0.25
dtype: float64

In [26]:
print(df.mean(axis=1))

a    1.40
b    1.25
c     NaN
d   -0.25
dtype: float64

In [27]:
print(df.mean(axis=1, skipna=False)) # NaN은 제외

a     NaN
b    1.25
c     NaN
d   -0.25
dtype: float64

In [28]:
df.count()

one    3
two    2
dtype: int64

In [29]:
df.count(axis=1)

a    1
b    2
c    0
d    2
dtype: int64

In [30]:
df.std(0)

one    3.521837
two    2.474874
dtype: float64

In [31]:
df.quantile(0.25)

one    0.950
two   -3.625
Name: 0.25, dtype: float64

In [32]:
df.describe()

            one       two
count  3.000000  2.000000
mean   2.966667 -2.750000
std    3.521837  2.474874
min    0.500000 -4.500000
25%    0.950000 -3.625000
50%    1.400000 -2.750000
75%    4.200000 -1.875000
max    7.000000 -1.000000

In [33]:
word=Series(['봄','여름','봄','봄','여름','가을','겨울','봄','여름'])
word.describe()

count     9
unique    4
top       봄
freq      4
dtype: object

In [ ]:
# pandas 를 사용한 I/O

In [36]:
import pandas as pd
df = pd.read_csv('dept.csv')
df

   DEPTNO       DNAME       LOC
0      10  ACCOUNTING  NEW YORK
1      20    RESEARCH    DALLAS
2      30       SALES   CHICAGO
3      40  OPERATIONS    BOSTON

In [35]:
%ls

 C 드라이브의 볼륨에는 이름이 없습니다.
 볼륨 일련 번호: 76CD-579A

 C:\Users\acorn\jupyter_workspace 디렉터리

2018-10-26  오전 10:35    <DIR>          .
2018-10-26  오전 10:35    <DIR>          ..
2018-10-26  오전 09:48    <DIR>          .ipynb_checkpoints
2018-10-25  오전 10:12           538,695 day1.ipynb
2018-10-25  오후 01:03            55,857 day2.ipynb
2018-10-26  오전 10:35               102 dept.csv
2018-10-25  오전 09:49    <DIR>          img
2018-10-24  오후 04:09               262 korea.txt
2018-10-23  오후 05:20               846 ML01.ipynb
2018-10-24  오후 03:47               545 populations.txt
2018-10-25  오후 12:13                64 student.txt
2018-10-25  오전 10:10               164 test.npy
2018-10-25  오전 10:21               260 test2.txt
2018-10-23  오후 05:14                72 Untitled.ipynb
2018-10-24  오전 10:07                72 Untitled1.ipynb
2018-10-25  오전 10:11             3,015 Untitled2.ipynb
2018-10-26  오전 10:20            17,160 Untitled3.ipynb
              13개 파일             617,114 바이트
               4개 디렉터리  186,866,786,304 바이트 남음

In [37]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [38]:
df2 = pd.read_table('dept.csv',sep=',')
df2

   DEPTNO       DNAME       LOC
0      10  ACCOUNTING  NEW YORK
1      20    RESEARCH    DALLAS
2      30       SALES   CHICAGO
3      40  OPERATIONS    BOSTON

In [41]:
df3 = pd.read_table('dept.csv',header=None)
print(df3)

                        0
0        DEPTNO,DNAME,LOC
1  10,ACCOUNTING,NEW YORK
2      20,RESEARCH,DALLAS
3        30,SALES,CHICAGO
4    40,OPERATIONS,BOSTON

In [42]:
df4 = pd.read_table('dept.csv',names=['부서번호','부서명','위치'])
print(df4)

                     부서번호  부서명  위치
0        DEPTNO,DNAME,LOC  NaN NaN
1  10,ACCOUNTING,NEW YORK  NaN NaN
2      20,RESEARCH,DALLAS  NaN NaN
3        30,SALES,CHICAGO  NaN NaN
4    40,OPERATIONS,BOSTON  NaN NaN

In [43]:
#컬럼 헤딩을 제거 해보자.
print(df4[df4.index>=1])

                     부서번호  부서명  위치
1  10,ACCOUNTING,NEW YORK  NaN NaN
2      20,RESEARCH,DALLAS  NaN NaN
3        30,SALES,CHICAGO  NaN NaN
4    40,OPERATIONS,BOSTON  NaN NaN

In [53]:
# %student1.txt 파일 읽기
df5=pd.read_csv('student1.txt', sep='\t', encoding='utf-8')
df5

    번호    이름    키  몸무게
0  101  hong  175   65
1  201   lee  185   85
2  301   kim  173   60
3  401  park  180   70

In [54]:
df6=pd.read_csv('student1.txt', sep='\t', encoding='utf-8',skiprows=[1,3])
df6

    번호    이름    키  몸무게
0  201   lee  185   85
1  401  park  180   70

In [55]:
print("저장하기")

저장하기

In [56]:
df.to_csv('test1.csv',sep=',')

In [58]:
df.to_csv('test2.csv',sep=',', index=False) # index번호 없음

In [59]:
df.to_csv('test3.csv',sep=',', index=False, header=False) # index번호 없음, header 없음

In [61]:
%ls

 C 드라이브의 볼륨에는 이름이 없습니다.
 볼륨 일련 번호: 76CD-579A

 C:\Users\acorn\jupyter_workspace 디렉터리

2018-10-26  오전 10:56    <DIR>          .
2018-10-26  오전 10:56    <DIR>          ..
2018-10-26  오전 09:48    <DIR>          .ipynb_checkpoints
2018-10-25  오전 10:12           538,695 day1.ipynb
2018-10-25  오후 01:03            55,857 day2.ipynb
2018-10-26  오전 10:35               102 dept.csv
2018-10-25  오전 09:49    <DIR>          img
2018-10-24  오후 04:09               262 korea.txt
2018-10-23  오후 05:20               846 ML01.ipynb
2018-10-24  오후 03:47               545 populations.txt
2018-10-25  오후 12:13                64 student.txt
2018-10-26  오전 10:49                96 student1.txt
2018-10-25  오전 10:10               164 test.npy
2018-10-26  오전 10:51               111 test1.csv
2018-10-26  오전 10:56               102 test2.csv
2018-10-25  오전 10:21               260 test2.txt
2018-10-26  오전 10:56                84 test3.csv
2018-10-23  오후 05:14                72 Untitled.ipynb
2018-10-24  오전 10:07                72 Untitled1.ipynb
2018-10-25  오전 10:11             3,015 Untitled2.ipynb
2018-10-26  오전 10:56            32,315 Untitled3.ipynb
              17개 파일             632,662 바이트
               4개 디렉터리  186,865,647,616 바이트 남음

In [64]:
# student1.txt 파일을 읽어 dataframe객체 df를 생성
df = pd.read_csv('student1.txt', sep='\t', encoding='utf-8')
df

    번호    이름    키  몸무게
0  101  hong  175   65
1  201   lee  185   85
2  301   kim  173   60
3  401  park  180   70

In [68]:
# 키와 몸무게의 합계, 평균을 구하시오
print(df.sum(axis=0))
print(df.mean(axis=0))

번호               1004
이름     hongleekimpark
키                 713
몸무게               280
dtype: object
번호     251.00
키      178.25
몸무게     70.00
dtype: float64

In [ ]:
print("-------------------------JSON 처리-----------------------------")

In [70]:
obj ="""
{"name":"scott",
"language":["C","C++","java","python","한국어"],
"age":20,
"exam":[{"first":80,"second":100},{"first":95,"second":70}]}
"""
obj

'\n{"name":"scott",\n"language":["C","C++","java","python","한국어"],\n"age":20,\n"exam":[{"first":80,"second":100},{"first":95,"second":70}]}\n'

<h3>obj는 현재 JSON형식의 문자열이다</h3>

In [73]:
import json
import requests
import pandas as pd

In [74]:
result = json.loads(obj)
result

{'name': 'scott',
 'language': ['C', 'C++', 'java', 'python', '한국어'],
 'age': 20,
 'exam': [{'first': 80, 'second': 100}, {'first': 95, 'second': 70}]}

In [75]:
print(type(result))

<class 'dict'>

In [76]:
jsonObj = json.dumps(obj)
jsonObj

'"\\n{\\"name\\":\\"scott\\",\\n\\"language\\":[\\"C\\",\\"C++\\",\\"java\\",\\"python\\",\\"\\ud55c\\uad6d\\uc5b4\\"],\\n\\"age\\":20,\\n\\"exam\\":[{\\"first\\":80,\\"second\\":100},{\\"first\\":95,\\"second\\":70}]}\\n"'

In [77]:
print(type(jsonObj))

<class 'str'>

In [78]:
# result의 값 중 name ==>
result['name']

'scott'

In [79]:
# JSON 타입의 객체를 Series객체로 만들어 낼 수 있다.
jsonname = pd.Series(result['language'])
jsonname

0         C
1       C++
2      java
3    python
4       한국어
dtype: object

In [ ]:
# Dataframe ??
df = DataFrame(result['language'])
df

In [82]:
print("웹에 있는 json읽기")
url = "http://192.168.0.206/bigdata/jsonTest.txt"
resp = requests.get(url)
data = resp.json()
print(data)
print(type(data))

웹에 있는 json읽기
{'name': ['scott', 'smith'], 'age': [22, 30], 'job': ['manager', 'analyst']}
<class 'dict'>

In [84]:
print(data['job'])

['manager', 'analyst']

In [85]:
# data = {"test":"hong","age":20}
df = DataFrame(data)
df

    name  age      job
0  scott   22  manager
1  smith   30  analyst

In [86]:
# 0 scott 22 manager
df.iloc[0]

name      scott
age          22
job     manager
Name: 0, dtype: object

In [88]:
# 자료 합치기
from pandas import DataFrame, Series
import numpy as np
import pandas as pd

df1 = DataFrame({"key":['b','b','a','c','a','a','b'],"data1":range(7)})
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [89]:
df2 = DataFrame({"key":['a','b','d'],"data1":range(3)})
df2

  key  data1
0   a      0
1   b      1
2   d      2

In [90]:
print(pd.merge(df1,df2,on="key"))

  key  data1_x  data1_y
0   b        0        1
1   b        1        1
2   b        6        1
3   a        2        0
4   a        4        0
5   a        5        0

In [92]:
print(pd.merge(df1,df2,on="key",how='inner')) # 교집합

  key  data1_x  data1_y
0   b        0        1
1   b        1        1
2   b        6        1
3   a        2        0
4   a        4        0
5   a        5        0

In [93]:
print(pd.merge(df1,df2,on="key",how='outer'))

  key  data1_x  data1_y
0   b      0.0      1.0
1   b      1.0      1.0
2   b      6.0      1.0
3   a      2.0      0.0
4   a      4.0      0.0
5   a      5.0      0.0
6   c      3.0      NaN
7   d      NaN      2.0

In [94]:
print(pd.merge(df1,df2,on="key",how='left'))

  key  data1_x  data1_y
0   b        0      1.0
1   b        1      1.0
2   a        2      0.0
3   c        3      NaN
4   a        4      0.0
5   a        5      0.0
6   b        6      1.0

In [95]:
print(pd.merge(df1,df2,on="key",how='right'))

  key  data1_x  data1_y
0   b      0.0        1
1   b      1.0        1
2   b      6.0        1
3   a      2.0        0
4   a      4.0        0
5   a      5.0        0
6   d      NaN        2

In [96]:
# 공통의 컬럼이 없을 경우
df3 = DataFrame({"key2":['a','b','c'],"data3":range(3)})
df3

  key2  data3
0    a      0
1    b      1
2    c      2

In [97]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [99]:
pd.merge(df1,df3,left_on="key",right_on='key2')

  key  data1 key2  data3
0   b      0    b      1
1   b      1    b      1
2   b      6    b      1
3   a      2    a      0
4   a      4    a      0
5   a      5    a      0
6   c      3    c      2

In [ ]:
print("numpy의 ndarray형 자료 합치기")

In [101]:
arr1 = np.arange(6).reshape(2,3)
arr1

array([[0, 1, 2],
       [3, 4, 5]])

In [102]:
arr2 = np.arange(4,10).reshape(2,3)
arr2

array([[4, 5, 6],
       [7, 8, 9]])

In [104]:
arrs=np.concatenate([arr1,arr2],axis=0)
arrs

array([[0, 1, 2],
       [3, 4, 5],
       [4, 5, 6],
       [7, 8, 9]])

In [105]:
arrs=np.concatenate([arr1,arr2],axis=1)
arrs

array([[0, 1, 2, 4, 5, 6],
       [3, 4, 5, 7, 8, 9]])

In [108]:
s1=Series([0,1],index=['a','b'])

s2=Series([2,3,4],index=['c','d','e'])

s3=Series([5,6],index=['f','g'])
print(s1)

a    0
b    1
dtype: int64

In [109]:
print(s2)
print(s3)

c    2
d    3
e    4
dtype: int64
f    5
g    6
dtype: int64

In [110]:
print(pd.concat([s1,s2,s3],axis=0))

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [111]:
print(pd.concat([s1,s2,s3],axis=1))

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [113]:
# 데이터 그룹화
import numpy as np
from pandas import DataFrame

df = DataFrame({"key1":['a','a','b','b','a'],
              "key2":['one','two','one','two','one'],
              "data1": np.random.randn(5),
                "data2": np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -0.146575  1.605837
1    a  two  1.101308 -1.785677
2    b  one  0.906542 -1.071570
3    b  two -0.060103 -1.264759
4    a  one  0.509555  0.394798

In [115]:
g1 = df['data1'].groupby(df['key1'])
g1.mean()
# select avg(data1)
#from df
#group by key1

key1
a    0.488096
b    0.423219
Name: data1, dtype: float64

In [116]:
# key2 값이 동일한 대상끼리 data2의 평균?
g2 = df['data2'].groupby(df['key2']).mean()
g2

key2
one    0.309689
two   -1.525218
Name: data2, dtype: float64

In [118]:
g3 = df['data1'].groupby([df['key1'],df['key2']]).mean()
g3

key1  key2
a     one     0.181490
      two     1.101308
b     one     0.906542
      two    -0.060103
Name: data1, dtype: float64

In [120]:
# pivot table : 데이터 중에 두개를 키로 하여 테이블 작성
data = {
    "city":['서울','경기','서울','경기'],
    "year":[2000,2000,2010,2005],
    "pop":[1000,900,1005,1100]}

In [121]:
df=DataFrame(data)
df

  city  year   pop
0   서울  2000  1000
1   경기  2000   900
2   서울  2010  1005
3   경기  2005  1100

In [122]:
df.pivot('city','year','pop')

year    2000    2005    2010
city
경기     900.0  1100.0     NaN
서울    1000.0     NaN  1005.0

In [123]:
df.pivot('year','city','pop')

city      경기      서울
year
2000   900.0  1000.0
2005  1100.0     NaN
2010     NaN  1005.0

In [125]:
# 인구정보를 기술통계량 구하기
df['pop'].describe()

count       4.000000
mean     1001.250000
std        81.687922
min       900.000000
25%       975.000000
50%      1002.500000
75%      1028.750000
max      1100.000000
Name: pop, dtype: float64